app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"
---
    def index
      # order = params[:order]
      @movies = Movie.all